Repository: logan-suu/Echo
Catalog: Echo/Resources/Localizable.xcstrings
Source language: en_us
Languages: zh_hans

source: %@ match
zh_hans: 匹配度 %@

source: %@ photo
zh_hans: %@ 照片

source: %@ video
zh_hans: %@ 视频

source: %lld cards
zh_hans: %lld 张卡片

source: %lld indexed items
zh_hans: %lld 个已索引条目

source: %lld memories · %lldm radius
zh_hans: %lld 条记忆 · 半径 %lld 米

source: %lld of %lld processed, %@
zh_hans: 已处理 %lld / %lld，%@

source: %lld source memories
zh_hans: %lld 条源记忆

source: %lld/%lld loaded
zh_hans: 已加载 %lld/%lld

source: %lldd ago
zh_hans: %lld 天前

source: %lldh ago
zh_hans: %lld 小时前

source: %lldm ago
zh_hans: %lld 分钟前

source: A 24-hour cooling period will begin. During this time, you can cancel. After cooling period ends, all Echo data will be permanently erased. Your original photos and files will not be affected.
zh_hans: 将开始 24 小时冷却期。期间你可以取消。冷却期结束后，所有 Echo 数据将被永久清除。你的原始照片和文件不受影响。

source: A bright moment for you
zh_hans: 为你点亮一个瞬间

source: A letter to future self from your park memories — every claim links to its source memory.
zh_hans: 一封来自你公园记忆、写给未来自己的信——每个表述都链接到其源记忆。

source: A memory from this place
zh_hans: 来自这个地方的记忆

source: A memory surfaced for you
zh_hans: 一段记忆为你浮现

source: A moment to reflect
zh_hans: 值得回味的时刻

source: A temporary issue occurred. Please wait and try again.
zh_hans: 出现临时问题。请稍候再试。

source: AI Creation
zh_hans: AI 创作

source: AI Models
zh_hans: AI 模型

source: About
zh_hans: 关于

source: Access Needed
zh_hans: 需要访问权限

source: Account & Data
zh_hans: 账户与数据

source: Action Blocked
zh_hans: 操作被阻止

source: Active
zh_hans: 已启用

source: Agree & Continue
zh_hans: 同意并继续

source: All AI models loaded and ready. Models run entirely on-device with no network required.
zh_hans: 所有 AI 模型已加载就绪。模型完全在设备端运行，无需网络。

source: Allow
zh_hans: 允许

source: Allow %@ access
zh_hans: 允许访问 %@

source: Allow Access
zh_hans: 允许访问

source: Allow Echo to send you awakening notifications when memories surface.
zh_hans: 允许 Echo 在记忆浮现时向你发送唤醒通知。

source: An interrupted task was found with %lld of %lld items completed. Continue where you left off?
zh_hans: 发现一个中断的任务，已完成 %lld / %lld 项。从上次停止的地方继续吗？

source: Anniversary Awakening
zh_hans: 纪念日唤醒

source: App Language
zh_hans: App 语言

source: Arrived at %@
zh_hans: 已到达 %@

source: Audit Log
zh_hans: 审计日志

source: Audit log records the last 30 days of privacy operations. Contains no user data — only operation types, timestamps, and hash digests.
zh_hans: 审计日志记录最近 30 天的隐私操作。不含用户数据——仅包含操作类型、时间戳和哈希摘要。

source: Authorized
zh_hans: 已授权

source: Awakening
zh_hans: 唤醒

source: Awakening Types
zh_hans: 唤醒类型

source: Awakening settings
zh_hans: 唤醒设置

source: Awakenings
zh_hans: 唤醒

source: Background Auto Sync
zh_hans: 后台自动同步

source: Background Tasks
zh_hans: 后台任务

source: Before you begin, please review how Echo handles your data.
zh_hans: 开始之前，请了解 Echo 如何处理你的数据。

source: Building vector index
zh_hans: 正在构建向量索引

source: Cache
zh_hans: 缓存

source: Cancel
zh_hans: 取消

source: Cancel %@
zh_hans: 取消 %@

source: Cancel Task
zh_hans: 取消任务

source: Cancelled
zh_hans: 已取消

source: Choose Language
zh_hans: 选择语言

source: Choose a format for this creation.
zh_hans: 为此创作选择格式。

source: Choose a template
zh_hans: 选择模板

source: Choose how to remove this memory. Your photos and files in the system library are kept unless you choose to delete the original.
zh_hans: 选择如何移除这条记忆。除非你选择删除原始文件，系统相册中的照片和文件将被保留。

source: Cleanup did not complete. Please retry.
zh_hans: 清理未完成。请重试。

source: Clear Cache
zh_hans: 清除缓存

source: Close
zh_hans: 关闭

source: Configure how Echo proactively delivers memories based on location, date anniversaries, and mood.
zh_hans: 配置 Echo 如何基于位置、日期纪念日和情绪主动投递记忆。

source: Consent Declined
zh_hans: 已拒绝同意

source: Consent Not Saved
zh_hans: 同意未能保存

source: Consent revocation is unavailable
zh_hans: 撤回同意不可用

source: Content conflict
zh_hans: 内容冲突

source: Continue
zh_hans: 继续

source: Continue Anyway
zh_hans: 仍然继续

source: Copy
zh_hans: 复制

source: Creation copied to clipboard
zh_hans: 创作已复制到剪贴板

source: Custom Tags
zh_hans: 自定义标签

source: Daily 9:00 AM — memories from this day in past years
zh_hans: 每天 9:00——往年今日的记忆

source: Data Management
zh_hans: 数据管理

source: Data Migration Guide
zh_hans: 数据迁移指引

source: Data Sources
zh_hans: 数据源

source: Database
zh_hans: 数据库

source: Decline
zh_hans: 拒绝

source: Decline %@ access for now
zh_hans: 暂时拒绝访问 %@

source: Degradation banner: %@
zh_hans: 降级横幅：%@

source: Delete All Echo Data
zh_hans: 删除所有 Echo 数据

source: Delete original file too
zh_hans: 同时删除原始文件

source: Delivery Status
zh_hans: 投递状态

source: Description
zh_hans: 描述

source: Detailed audit log viewer coming in next iteration.
zh_hans: 详细审计日志查看器将在下一迭代提供。

source: Detailed feedback management coming in next iteration.
zh_hans: 详细反馈管理将在下一迭代提供。

source: Detailed model status page coming in next iteration.
zh_hans: 详细模型状态页将在下一迭代提供。

source: Detected · %@
zh_hans: 检测语言 · %@

source: Device Migration
zh_hans: 设备迁移

source: Device temperature is high. Some features have been temporarily simplified.
zh_hans: 设备温度较高，部分功能已临时简化。

source: Dislike this result
zh_hans: 点踩此结果

source: Dismiss banner
zh_hans: 关闭横幅

source: Done
zh_hans: 完成

source: Echo can wake with memories tied to where you are.
zh_hans: Echo 可以在你所在的地方唤醒相关记忆。

source: Echo cannot process your memories without consent. Reopen Echo to review the privacy policy.
zh_hans: 未经同意，Echo 无法处理你的记忆。请重新打开 Echo 查看隐私政策。

source: Echo cannot process your memories without your consent. Your data stays on this device.
zh_hans: 未经你的同意，Echo 无法处理你的记忆。你的数据保留在此设备上。

source: Echo could not initialize its local storage. Reinstall Echo or restart the device.
zh_hans: Echo 无法初始化本地存储。请重新安装 Echo 或重启设备。

source: Echo creation
zh_hans: Echo 创作

source: Echo reads health context to enrich memory awakening. Raw values are not stored.
zh_hans: Echo 读取健康上下文以丰富记忆唤醒。不存储原始数值。

source: Echo reads your photo library locally to index and search images and videos.
zh_hans: Echo 在本地读取你的照片图库，以索引和搜索图片与视频。

source: Echo sends awakening notifications for memories at places, on anniversaries, and when your mood changes.
zh_hans: Echo 会在地点、纪念日以及情绪变化时发送记忆唤醒通知。

source: Echo sends local reminders to surface your memories at the right moment.
zh_hans: Echo 发送本地提醒，在合适的时刻浮现你的记忆。

source: Echo welcome page. Your memories will appear here.
zh_hans: Echo 欢迎页。你的记忆将显示在这里。

source: Edit
zh_hans: 编辑

source: Edit Memory
zh_hans: 编辑记忆

source: Emotion Awakening
zh_hans: 情绪唤醒

source: Enable
zh_hans: 启用

source: Enable notifications to receive awakening alerts.
zh_hans: 启用通知以接收唤醒提醒。

source: English
zh_hans: 英文

source: Excluded Items
zh_hans: 已排除项目

source: Excluded Items, %lld items
zh_hans: 已排除项目，%lld 项

source: Export Audit Log
zh_hans: 导出审计日志

source: Export Audit Log (JSON)
zh_hans: 导出审计日志 (JSON)

source: Export PDF / Markdown
zh_hans: 导出 PDF / Markdown

source: Export creation
zh_hans: 导出创作

source: Failed to clear cache
zh_hans: 清除缓存失败

source: Failed to load settings
zh_hans: 加载设置失败

source: Failed to reset feedback
zh_hans: 重置反馈失败

source: Failed to start data deletion
zh_hans: 启动数据删除失败

source: Feedback & Learning
zh_hans: 反馈与学习

source: Feedback Records
zh_hans: 反馈记录

source: Feedback Records, %lld entries
zh_hans: 反馈记录，%lld 条

source: Follow System
zh_hans: 跟随系统

source: For complete memories, set iCloud Photos to 'Download and Keep Originals' or download before using Echo. Optimized storage may not be recognizable.
zh_hans: 为获得完整记忆，请将 iCloud 照片设置为“下载并保留原片”，或在使用 Echo 前下载。优化存储可能无法识别。

source: Functional limitations due to model loading issues.
zh_hans: 模型加载问题导致功能受限。

source: Generate
zh_hans: 生成

source: Generating creation
zh_hans: 正在生成创作

source: Generating…
zh_hans: 生成中…

source: Generation is currently unavailable. Please try again.
zh_hans: 生成功能当前不可用。请重试。

source: Geofence Awakening
zh_hans: 地理围栏唤醒

source: Geofence Details
zh_hans: 地理围栏详情

source: Geofences are created automatically when you visit places frequently.
zh_hans: 当你经常访问某些地方时，地理围栏会自动创建。

source: Get Started
zh_hans: 开始使用

source: Health
zh_hans: 健康

source: Health data access enables mood-based memory delivery.
zh_hans: 健康数据访问权限支持基于情绪的记忆投递。

source: Hello, world!
zh_hans: 你好，世界！

source: Home
zh_hans: 首页

source: Inactive
zh_hans: 未启用

source: Index Unavailable
zh_hans: 索引不可用

source: Indexed Items
zh_hans: 已索引条目

source: Items excluded from Echo indexing. You can restore them here if the original file still exists.
zh_hans: 已从 Echo 索引中排除的项目。若原始文件仍存在，可在此恢复。

source: Joyful memories from the past
zh_hans: 过去快乐的记忆

source: Just now
zh_hans: 刚刚

source: Keep Running
zh_hans: 保持运行

source: Keep my edit
zh_hans: 保留我的编辑

source: Last delivery: %@
zh_hans: 上次投递：%@

source: Learn how to transfer your Echo data to a new device using AirDrop or encrypted Finder backup.
zh_hans: 了解如何通过 AirDrop 或加密 Finder 备份将 Echo 数据传输到新设备。

source: Like this result
zh_hans: 点赞此结果

source: Loading AI model
zh_hans: 正在加载 AI 模型

source: Loading awakening cards
zh_hans: 正在加载唤醒卡片

source: Loading awakening settings...
zh_hans: 正在加载唤醒设置...

source: Loading memory…
zh_hans: 正在加载记忆…

source: Loading models…
zh_hans: 正在加载模型…

source: Loading tasks...
zh_hans: 正在加载任务...

source: Location
zh_hans: 位置

source: Location access enables geofence-based memory delivery.
zh_hans: 位置访问权限支持基于地理围栏的记忆投递。

source: Location is required for geofence awakening. Health data enables emotion-based awakening. Permissions can also be managed in Settings.
zh_hans: 地理围栏唤醒需要位置权限。健康数据支持情绪唤醒。权限也可在设置中管理。

source: Low Power Mode is enabled. Memory search precision may be reduced.
zh_hans: 省电模式已启用，记忆检索精度可能降低。

source: Low confidence search results
zh_hans: 低置信度搜索结果

source: Management interface coming in next iteration.
zh_hans: 管理界面将在下一迭代提供。

source: Mark as problem
zh_hans: 标记为问题

source: Marked as problematic from search results
zh_hans: 已从搜索结果标记为问题

source: Memories from years past
zh_hans: 往年今日的记忆

source: Memory
zh_hans: 记忆

source: Memory Policy
zh_hans: 记忆策略

source: Memory details: %@, %@, %@
zh_hans: 记忆详情：%@、%@、%@

source: Memory index is not ready yet.
zh_hans: 记忆索引尚未就绪。

source: Memory removed
zh_hans: 记忆已移除

source: Memory removed from Echo
zh_hans: 记忆已从 Echo 移除

source: Memory retention policy: Permanent. All memories are kept forever, only deleted manually.
zh_hans: 记忆保留策略：永久。所有记忆永久保留，仅可手动删除。

source: Migration Guide
zh_hans: 迁移指引

source: Migration guide coming in next iteration.
zh_hans: 迁移指引将在下一迭代提供。

source: Model Status
zh_hans: 模型状态

source: Model Status, %lld of %lld loaded
zh_hans: 模型状态，已加载 %lld / %lld

source: Models Unavailable
zh_hans: 模型不可用

source: Monitored Geofences
zh_hans: 监控中的地理围栏

source: Name
zh_hans: 名称

source: Never
zh_hans: 从未

source: No active tasks
zh_hans: 无活跃任务

source: No geofences configured
zh_hans: 尚未配置地理围栏

source: No memories found
zh_hans: 未找到记忆

source: No memories found for your search
zh_hans: 未找到与搜索相关的记忆

source: No source memories found
zh_hans: 未找到源记忆

source: No source memories found for this template
zh_hans: 此模板未找到源记忆

source: Not Now
zh_hans: 暂不

source: Not authorized
zh_hans: 未授权

source: Notes
zh_hans: 备忘录

source: Notifications
zh_hans: 通知

source: Notifications enabled
zh_hans: 通知已启用

source: Offline generation runtime is not available. Please try again.
zh_hans: 离线生成运行时不可用。请重试。

source: Offline mode
zh_hans: 离线模式

source: Offline mode — showing cached memories only
zh_hans: 离线模式——仅显示已缓存的记忆

source: On this day
zh_hans: 那年今日

source: Open Settings
zh_hans: 打开设置

source: Open Settings to manage iCloud Photos storage
zh_hans: 打开设置以管理 iCloud 照片存储

source: Open full creation
zh_hans: 打开完整创作

source: Open settings for model recovery
zh_hans: 打开设置以恢复模型

source: Original: %@
zh_hans: 原文：%@

source: Pause %@
zh_hans: 暂停 %@

source: Pause background tasks during low power
zh_hans: 低电量时暂停后台任务

source: Paused
zh_hans: 已暂停

source: Periodic Scan
zh_hans: 定期扫描

source: Periodic Scan for Missing Data
zh_hans: 定期扫描缺失数据

source: Permanent
zh_hans: 永久保留

source: Personal Prompt
zh_hans: 个人提示词

source: Photo access is required for Echo to index your memories. Notes and Voice Memos support coming via Share Extension — share content directly to Echo to index it.
zh_hans: Echo 需要照片访问权限来索引你的记忆。备忘录与语音备忘录通过分享扩展支持——直接将内容分享给 Echo 即可索引。

source: Photos
zh_hans: 照片

source: Please try again later.
zh_hans: 请稍后重试。

source: Please try again.
zh_hans: 请重试。

source: Privacy & Audit
zh_hans: 隐私与审计

source: Privacy & Consent
zh_hans: 隐私与同意

source: Privacy Consent Declined
zh_hans: 已拒绝隐私同意

source: Progress up to this point will be saved. You can resume later.
zh_hans: 当前进度将被保存。你可以稍后继续。

source: Push deduplication: this geofence delivers only once per entry. You must exit and re-enter for a new delivery. Continuous stays never repeat push.
zh_hans: 推送去重：此围栏每次进入只投递一次。需离开后再次进入才会再次投递。持续停留不会重复推送。

source: Radius
zh_hans: 半径

source: Receive memories when arriving at meaningful places
zh_hans: 到达有意义的地方时收到记忆

source: Remove Memory…
zh_hans: 移除记忆…

source: Remove from Echo only
zh_hans: 仅从 Echo 移除

source: Remove this memory?
zh_hans: 移除这条记忆？

source: Required Permissions
zh_hans: 所需权限

source: Required models could not be loaded. Reinstall Echo to restore them.
zh_hans: 所需模型无法加载。请重新安装 Echo 以恢复。

source: Reset All Feedback
zh_hans: 重置所有反馈

source: Reset All Feedback Learning Data
zh_hans: 重置所有反馈学习数据

source: Reset to default prompt
zh_hans: 重置为默认提示词

source: Restart
zh_hans: 重新开始

source: Results
zh_hans: 结果

source: Resume %@
zh_hans: 恢复 %@

source: Resume interrupted task
zh_hans: 恢复中断的任务

source: Retry
zh_hans: 重试

source: Retry model load
zh_hans: 重试加载模型

source: Running
zh_hans: 运行中

source: Save
zh_hans: 保存

source: Save to Notes
zh_hans: 保存到备忘录

source: Saved
zh_hans: 已保存

source: Saving to Notes…
zh_hans: 正在保存到备忘录…

source: Search
zh_hans: 搜索

source: Search Unavailable
zh_hans: 搜索不可用

source: Search failed
zh_hans: 搜索失败

source: Search failed. Please try again.
zh_hans: 搜索失败。请重试。

source: Search is currently unavailable
zh_hans: 搜索当前不可用

source: Search your memories
zh_hans: 搜索你的记忆

source: Searching memories
zh_hans: 正在搜索记忆

source: Searching…
zh_hans: 搜索中…

source: Select the language Echo uses to display and respond.
zh_hans: 选择 Echo 用于显示和回复的语言。

source: Settings
zh_hans: 设置

source: Settings error
zh_hans: 设置错误

source: Settings loading was cancelled
zh_hans: 设置加载已取消

source: Share
zh_hans: 分享

source: Share / Print
zh_hans: 分享 / 打印

source: Share Creation
zh_hans: 分享创作

source: Share or export this creation as text, PDF, or Markdown.
zh_hans: 将此创作以文本、PDF 或 Markdown 形式分享或导出。

source: Simplified Chinese
zh_hans: 简体中文

source: Some models failed to load. Basic keyword search is still available.
zh_hans: 部分模型加载失败。基础关键词搜索仍可用。

source: Some results have lower relevance. Try refining your keywords or phrasing.
zh_hans: 部分结果相关性较低。试试调整关键词或表述方式。

source: Something went wrong
zh_hans: 出了点问题

source: Something went wrong briefly. Echo is retrying automatically.
zh_hans: 出现短暂错误。Echo 正在自动重试。

source: Source memory citation
zh_hans: 源记忆引用

source: Start Deletion
zh_hans: 开始删除

source: Startup Failed
zh_hans: 启动失败

source: Status
zh_hans: 状态

source: Storage & Cache
zh_hans: 存储与缓存

source: Surfaces joyful memories when mood is low
zh_hans: 情绪低落时浮现快乐的记忆

source: Syncing photos
zh_hans: 正在同步照片

source: Tap Retry to reload settings
zh_hans: 点击“重试”重新加载设置

source: Tap a geofence to view details. Geofences are automatically created from your visit patterns. Push deduplication: a geofence only delivers once per entry; must exit and re-enter to deliver again.
zh_hans: 点击地理围栏查看详情。地理围栏根据你的访问模式自动创建。推送去重：每个围栏每次进入只投递一次；需离开后再次进入才会再次投递。

source: Terminates the task and saves progress
zh_hans: 终止任务并保存进度

source: The active index route is unavailable.
zh_hans: 当前索引路由不可用。

source: The external source was modified while you were editing. Your edits are not saved.
zh_hans: 你编辑期间外部源已被修改。你的编辑未保存。

source: The previous cleanup did not complete. Try again.
zh_hans: 上次清理未完成。请重试。

source: This action could not be completed. You can retry it when ready.
zh_hans: 此操作无法完成。你可以在准备好时重试。

source: This feature is unavailable until the issue is fixed. Open Settings for repair options.
zh_hans: 问题修复前此功能不可用。打开设置查看修复选项。

source: This memory has been removed from Echo.
zh_hans: 这条记忆已从 Echo 移除。

source: This will clear translation cache, search result cache, and thumbnail cache. Vector indices and original media will not be affected.
zh_hans: 这将清除翻译缓存、搜索结果缓存和缩略图缓存。向量索引和原始媒体不受影响。

source: This will permanently delete all your feedback learning data. Re-ranking weights will return to defaults. This cannot be undone.
zh_hans: 这将永久删除你的所有反馈学习数据。重排权重将恢复默认。此操作无法撤销。

source: Thoughtful memories
zh_hans: 引人深思的记忆

source: Timestamp
zh_hans: 时间戳

source: Title
zh_hans: 标题

source: Translated · %@
zh_hans: 已翻译 · %@

source: Translated: %@
zh_hans: 译文：%@

source: Translating memory
zh_hans: 正在翻译记忆

source: Translating…
zh_hans: 翻译中…

source: Translation failed. %@
zh_hans: 翻译失败。%@

source: Translation is currently unavailable. Please try again.
zh_hans: 翻译当前不可用。请重试。

source: Try a different search term.
zh_hans: 试试其他搜索词。

source: Try a different template or add more memories.
zh_hans: 试试其他模板或添加更多记忆。

source: Two versions of this memory conflict. Choose which one to keep.
zh_hans: 这条记忆的两个版本存在冲突。选择要保留的版本。

source: Unable to Load Settings
zh_hans: 无法加载设置

source: Unable to check saved progress
zh_hans: 无法检查已保存的进度

source: Unable to check saved progress. Please try again.
zh_hans: 无法检查已保存的进度。请重试。

source: Unable to continue
zh_hans: 无法继续

source: Unable to generate
zh_hans: 无法生成

source: Unable to load awakening cards. Please try again.
zh_hans: 无法加载唤醒卡片。请重试。

source: Unable to load background tasks
zh_hans: 无法加载后台任务

source: Unable to load background tasks. Please try again.
zh_hans: 无法加载后台任务。请重试。

source: Unable to load memory
zh_hans: 无法加载记忆

source: Unable to load memory. Please try again later.
zh_hans: 无法加载记忆。请稍后重试。

source: Unable to load this memory. Please try again.
zh_hans: 无法加载此记忆。请重试。

source: Use external version
zh_hans: 使用外部版本

source: Used for emotion-based awakening to surface joyful memories when mood is low.
zh_hans: 用于情绪低落时浮现快乐记忆的情绪唤醒。

source: Used for geofence-based memory awakening when you arrive at meaningful places.
zh_hans: 用于你到达有意义的地方时基于地理围栏的记忆唤醒。

source: Used to personalize AI responses. Confirmed drafts are injected into synthesis requests.
zh_hans: 用于个性化 AI 回复。确认后的草稿会注入合成请求。

source: Vector Store
zh_hans: 向量库

source: Version
zh_hans: 版本

source: Video audio
zh_hans: 视频音频

source: Videos
zh_hans: 视频

source: View Audit Log
zh_hans: 查看审计日志

source: View diff and merge
zh_hans: 查看差异并合并

source: Voice Memos
zh_hans: 语音备忘录

source: Voice memo
zh_hans: 语音备忘录

source: When off, background tasks keep running in Low Power Mode and may use more battery.
zh_hans: 关闭后，低电量模式下后台任务仍会运行，可能增加耗电。

source: Your consent could not be saved. Restart Echo to try again.
zh_hans: 你的同意未能保存。请重启 Echo 重试。

source: Your memories, within reach.
zh_hans: 你的记忆，触手可及。

source: Your system language is not supported. Echo will use Simplified Chinese.
zh_hans: 不支持你的系统语言。Echo 将使用简体中文。

source: iCloud Photos
zh_hans: iCloud 照片

source: Confirm
zh_hans: 确认

source: Details
zh_hans: 详情

source: 🔮 Preview
zh_hans: 🔮 预览

source: 🔗 MemoryID:…2222
zh_hans: 🔗 记忆ID:…2222

source: Echo is getting ready…
zh_hans: Echo 正在准备中…

source: Photos, videos, notes and voice — all offline on your device.
zh_hans: 照片、视频、备忘录和语音——全部离线存储在你的设备上。

source: Clear
zh_hans: 清除

source: Reset
zh_hans: 重置

source: Loading settings...
zh_hans: 正在加载设置…

source: Deleting Echo data will erase all indices, vectors, settings and feedback. Your original photos, videos, and files in system apps will NOT be affected. A 24-hour cooling period applies before data is permanently removed.
zh_hans: 删除 Echo 数据将清除所有索引、向量、设置和反馈。你在系统应用中的原始照片、视频和文件不受影响。数据永久删除前有 24 小时冷却期。

source: Echo · 回响 — Your memories, always within reach. All AI processing runs locally on your device. No data ever leaves your phone.
zh_hans: Echo · 回响 — 你的记忆，永远触手可及。所有 AI 处理均在设备本地完成，没有任何数据离开你的手机。

source: Geofence push resets on exit+re-enter. Anniversary check runs daily at 9:00 AM. Emotion analysis caches results for 24 hours and uses 30-second debounce for new queries/feelings. Auditing records all awakening activity for 30 days (viewable in Audit Log).
zh_hans: 地理围栏推送在退出+重新进入时重置。纪念日检查每天上午 9:00 运行。情绪分析缓存结果 24 小时，并对新查询/感受使用 30 秒防抖。审计记录所有唤醒活动 30 天（可在审计日志中查看）。

source: %lld active task
zh_hans: %lld 个进行中任务

source: %lld active tasks
zh_hans: %lld 个进行中任务

source: Your memories, always within reach. Memories from special places, past moments, and meaningful days will appear here.
zh_hans: 你的记忆，随时触手可及。 来自特别的地方、过去的时刻和有意义的日子的记忆将显示在这里。

source: Unable to generate a response in your language. Please try again later.
zh_hans: 暂时无法生成符合您语言的回应，请稍后重试。

source: A memory from %@
zh_hans: 来自 %@ 的记忆

source: A bright moment from the past
zh_hans: 来自过去的美好时刻

source: A quiet moment to reflect
zh_hans: 一个安静反思的时刻

source: Memories from years past on this day
zh_hans: 这一天的往日记忆

source: Echo Memory
zh_hans: Echo 记忆

# settings.photo.access.denied
source: Photo access is required to index your memories. You can enable it in System Settings.
zh_hans: 需要照片访问权限才能索引你的记忆。你可以在系统设置中开启。

# settings.photo.import.unavailable
source: Photo import is not ready yet. Please try again in a moment.
zh_hans: 照片导入尚未就绪，请稍后再试。
